Verification/NoFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     asmFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         432000;

deltaT          10.0;

writeControl    runTime;

writeInterval   600;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{
    volFieldValue1
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;
        writeFields     false;

        regionType      all;
        operation       volAverage;

        fields
        (
            SS
            XS
            XBH
            XBA
            XP
            SO
            SNO
            SNH
            SND
            XND
        );
    }
}


// ************************************************************************* //
