Verification/NoFlow/constant/biokineticsProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      biokineticsProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

stoichiometry
{
    YA          YA  [0 0 0 0 0 0 0] 0.24;
    YH          YH  [0 0 0 0 0 0 0] 0.67;
    fP          fP  [0 0 0 0 0 0 0] 0.08;
    iXB         iXB [0 0 0 0 0 0 0] 0.086;
    iXP         iXP [0 0 0 0 0 0 0] 0.06;
}

kinetics
{
    muH         muH   [ 0  0 -1 0 0 0 0] 3.47e-5;
    KS          KS    [ 1 -3  0 0 0 0 0] 0.02;
    KOH         KOH   [ 1 -3  0 0 0 0 0] 0.0002;
    KNO         KNO   [ 1 -3  0 0 0 0 0] 0.0005;
    bH          bH    [ 0  0 -1 0 0 0 0] 4.86e-6;
    etag        etag  [ 0  0  0 0 0 0 0] 0.8;
    etah        etah  [ 0  0  0 0 0 0 0] 0.4;
    kh          kh    [ 0  0 -1 0 0 0 0] 2.31e-5;
    KX          KX    [ 0  0  0 0 0 0 0] 0.02;
    muA         muA   [ 0  0 -1 0 0 0 0] 5.79e-6;
    KNH         KNH   [ 1 -3  0 0 0 0 0] 0.001;
    KOA         KOA   [ 1 -3  0 0 0 0 0] 0.0004;
    bA          bA    [ 0  0 -1 0 0 0 0] 4.86e-6;
    ka          ka    [-1  3 -1 0 0 0 0] 9.26e-4;
}

diffusivities
{
    DSS         DSS    [ 0 2 -1 0 0 0 0] 1e-6;
    DSO         DSO    [ 0 2 -1 0 0 0 0] 1e-6;
    DSNO        DSNO   [ 0 2 -1 0 0 0 0] 1e-6;
    DSNH        DSNH   [ 0 2 -1 0 0 0 0] 1e-6;
    DSND        DSND   [ 0 2 -1 0 0 0 0] 1e-6;
    DXS         DXS    [ 0 2 -1 0 0 0 0] 1e-9;
    DXBH        DXBH   [ 0 2 -1 0 0 0 0] 1e-9;
    DXBA        DXBA   [ 0 2 -1 0 0 0 0] 1e-9;
    DXP         DXP    [ 0 2 -1 0 0 0 0] 1e-9;
    DXND        DXND   [ 0 2 -1 0 0 0 0] 1e-9;
}

oxygenTransferModel
{
    type constant;
    constantCoeffs
    {
        kLa      kLa   [ 0  0 -1 0 0 0 0] 0.00243;
    }
}

SOsat    SOsat [ 1 -3  0 0 0 0 0] 0.00928;

ScT 0.7;
liquidName water;
gasName    air;

// ************************************************************************* //
