Verification/NoFlow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;
    "div\(phi,alpha.*\)"            Gauss vanLeer;
    "div\(phir,alpha.*,alpha.*\)"   Gauss vanLeer;
    "div\(alphaPhi.*,U.*\)"         Gauss limitedLinearV 1;
    "div\(alphaPhi.*,S.*\)"          Gauss limitedLinear 1;
    "div\(alphaPhi.*,X.*\)"          Gauss limitedLinear 1;
    div(Rc)                         Gauss linear;
    "div\(phi.*,U.*\)"              Gauss limitedLinearV 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
